---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.SizeString
source: html/639d3932-d96f-9f91-75c9-c63ace9c42f8.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.SizeString Property

The size display string for the straight that can be used by the user interface.

## Syntax (C#)
```csharp
public string SizeString { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null